Table of Contents
 Class ReinfBarInclined
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representing reinforcement inclined bar in IDEA StatiCa Detail
[OpenModelClass(typeof(Reinforcement))]
public class ReinfBarInclined : ReinforcementGroup
Inheritance
object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfBarInclined
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ReinfBarInclined()
Constructor
public ReinfBarInclined()
Properties
 AddBarOnBottom
Add bar on Bottom - possible only for FullLength
public bool AddBarOnBottom { get; set; }
Property Value
bool
 AddBarOnTop
Add bar on top - possible only for FullLength
public bool AddBarOnTop { get; set; }
Property Value
bool
 Angle
Angle between bar and master edge
public double Angle { get; set; }
Property Value
double
 BottomLength
Length of additional bar on the bottom
public double BottomLength { get; set; }
Property Value
double
 InclinedReinfBarType
Type of inclined reinf bar
public InclinedReinfBarType InclinedReinfBarType { get; set; }
Property Value
InclinedReinfBarType
 MasterComponent
Master component of reinforcement
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterEdge
Master edge of reinforcement - edge from which is measured angle
public ReferenceElement MasterEdge { get; set; }
Property Value
ReferenceElement
 MasterPoint
Master point of reinforcement
public ReferenceElement MasterPoint { get; set; }
Property Value
ReferenceElement
 TopLength
Length of additional bar on the top
public double TopLength { get; set; }
Property Value
double
 Edit this page